Проверим, что у вас подключена возможность работы с SQL

In [3]:
%load_ext sql
%sql sqlite://

'Connected: @None'

Создадим таблицу специальностей со следующими полями:
1. id - уникальный идентификатор специальности
2. Name - Специальность

In [4]:
%%sql 
drop table if exists Students;
drop table if exists Specialities;

CREATE TABLE Specialities
(
    id integer primary key, 
    Name varchar(50)
);

 * sqlite://
Done.
Done.
Done.

[]

Проверим, что таблица создана

In [5]:
%sql select * from Specialities

 * sqlite://
Done.

[]

Заполним таблицу данными

In [6]:
%%sql
insert Into Specialities(id, name) values (1, 'Биотехнические системы и технологии');
insert Into Specialities(id, name) values (2, 'Компьютерная безопасность');
insert Into Specialities(id, name) values (3, 'Прикладная математика и информатика');
insert Into Specialities(id, name) values (4, 'Мехатроника и робототехника');
insert Into Specialities(id, name) values (5, 'Системный анализ и управление');
insert Into Specialities(id, name) values (6, 'Информационная безопасность телекоммуникационных систем');
insert Into Specialities(id, name) values (7, 'Управление в технических системах');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

SQLite требует включение поддержки внешних ключей.
Более подробно можно посмотреть [здесь](https://sqlite.org/foreignkeys.html)

In [7]:
%%sql
PRAGMA foreign_keys = ON;

 * sqlite://
Done.

[]

Создадим таблицу Студентов со следующими полями:
1. Student_id - уникальный идентификатор студента
2. Name - имя студента
3. Second Name - фамилия студента
4. Speciality - специальность студента
5. StudyGroup - группа студента 
6. GPA - средний балл

In [8]:
%%sql 
drop table if exists Students;

CREATE TABLE Students 
(
    student_id integer primary key, 
    Name varchar(50),
    SecondName varchar(50),
    Speciality_id integer ,
    StudyGroup varchar(20),
    GPA number,
    foreign key(Speciality_id) references Specialities(id)
);

 * sqlite://
Done.
Done.

[]

Проверим, что таблица создана

In [9]:
%sql select * from Students

 * sqlite://
Done.

[]

Заполним таблице данными

In [10]:
%%sql
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (1, 'Альянов', 'Николай', 1, '04-20', 3.58);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (2, 'Крыгина', 'Екатерина', 1, '01-20', 4.58);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (3, 'Исаева', 'Анна', 1, '01-20', 4.75);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (4, 'Егоров', 'Павел', 2, '01-20', 4.83);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (5, 'Тихомиров', 'Тимофей', 2, '03-20', 4.18);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (6, 'Ширшов', 'Александр', 2, '06-20', 3.91);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (7, 'Фатеев', 'Максим', 3, '05-20', 3.8);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (8, 'Киселев', 'Петр',  3, '05-20', 3.5);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (9, 'Агашкина', 'Дарья', 4, '02-20', 4.18);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (10, 'Горин', 'Олег', 5, '01-20', 3.89);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (11, 'Комарова', 'Виктория', 6, '02-20', 4.83);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (12, 'Челыхов', 'Иван', 6, '06-20', 4.45);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (13, 'Назаров', 'Александр', 6, '06-20', 3.73);
insert into Students(student_id, SecondName, Name, Speciality_id, StudyGroup, GPA) VALUES (14, 'Горлова', 'Ксения', 7, '01-20', 5);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

Проверим наличие данных

In [11]:
%sql select * from Students

 * sqlite://
Done.

[(1, 'Николай', 'Альянов', 1, '04-20', 3.58),
 (2, 'Екатерина', 'Крыгина', 1, '01-20', 4.58),
 (3, 'Анна', 'Исаева', 1, '01-20', 4.75),
 (4, 'Павел', 'Егоров', 2, '01-20', 4.83),
 (5, 'Тимофей', 'Тихомиров', 2, '03-20', 4.18),
 (6, 'Александр', 'Ширшов', 2, '06-20', 3.91),
 (7, 'Максим', 'Фатеев', 3, '05-20', 3.8),
 (8, 'Петр', 'Киселев', 3, '05-20', 3.5),
 (9, 'Дарья', 'Агашкина', 4, '02-20', 4.18),
 (10, 'Олег', 'Горин', 5, '01-20', 3.89),
 (11, 'Виктория', 'Комарова', 6, '02-20', 4.83),
 (12, 'Иван', 'Челыхов', 6, '06-20', 4.45),
 (13, 'Александр', 'Назаров', 6, '06-20', 3.73),
 (14, 'Ксения', 'Горлова', 7, '01-20', 5)]

In [12]:
%sql select * from Specialities

 * sqlite://
Done.

[(1, 'Биотехнические системы и технологии'),
 (2, 'Компьютерная безопасность'),
 (3, 'Прикладная математика и информатика'),
 (4, 'Мехатроника и робототехника'),
 (5, 'Системный анализ и управление'),
 (6, 'Информационная безопасность телекоммуникационных систем'),
 (7, 'Управление в технических системах')]

## Задание 1. Напишите SQL-запрос, возвращающий фамилии всех студентов с именем Александр

In [13]:
%sql select SecondName from Students where Name = 'Александр';

 * sqlite://
Done.

[('Ширшов',), ('Назаров',)]

## Задание 2. Выведите все названия специальностей, на которых учится хотя бы один студент со средним баллом не менее 4. Имя специальности должно встречаться один раз в выводе

In [14]:
%sql select distinct Specialities.name from Specialities LEFT JOIN Students ON Students.Speciality_id = Specialities.id where Students.GPA > 4.0;

 * sqlite://
Done.

[('Биотехнические системы и технологии',),
 ('Компьютерная безопасность',),
 ('Мехатроника и робототехника',),
 ('Информационная безопасность телекоммуникационных систем',),
 ('Управление в технических системах',)]

## Задание 3. Вывести только тех студентов, фамилия которых начинается с 'К', а в имени присутствует 'е'.

In [17]:
%sql select * from Students where Name like '%е%' and SecondName REGEXP '^К';

 * sqlite://
Done.

[(2, 'Екатерина', 'Крыгина', 1, '01-20', 4.58),
 (8, 'Петр', 'Киселев', 3, '05-20', 3.5)]

## Задание 4. Вывести специальности (+ их средние баллы), количество групп в которых больше одной

In [ ]:
%sql select spec.name, AVG(s.GPA) from Students s LEFT JOIN Specialities spec ON s.Speciality_id = spec.id GROUP BY s.Speciality_id having count(distinct s.StudyGroup)>1;

 * sqlite://
Done.

[('Биотехнические системы и технологии', 4.303333333333334),
 ('Компьютерная безопасность', 4.306666666666667),
 ('Информационная безопасность телекоммуникационных систем', 4.336666666666667)]

## Задание 5. Для всех специальностей вывести средний балл по специальности для студентов, в чьей фамилия вторая буква НЕ 'а', при условии, что количество таких студентов на специальности не менее 2. В обратном случае, специальность выводить не требуется

In [ ]:
%sql select spec.name, AVG(s.GPA) from Students s LEFT JOIN Specialities spec ON s.Speciality_id = spec.id where s.SecondName not REGEXP '^.а' GROUP BY s.Speciality_id having count(distinct s.student_id)>1;

 * sqlite://
Done.

[('Биотехнические системы и технологии', 4.303333333333334),
 ('Компьютерная безопасность', 4.306666666666667),
 ('Информационная безопасность телекоммуникационных систем', 4.640000000000001)]